console.log('Этап3: добавление JavaScript');
console.log('Самооценка: 154/160 баллов');
console.log('Слайдер в секции Welcome +24');
console.log(
  'Слайдер в секции Video (в слайдах - видео с YouTube) +14 : не сделано: 1)если видео с YouTube проигрывается, клик по кнопке Pause останавливает его проигрывание. Также проигрывание видео останавливается, если кликнуть по другому слайду или кнопке Play в центре другого слайда. В указанной ситуации другое видео должно запуститься, а текущее остановиться. Невозможно проигрывание нескольких YouTube видео одновременно -2; 2)если внутри слайда проигрывается видео с YouTube, клик по стрелке перелистывания слайдов или клик по буллету останавливает проигрывание видео -2; 3) если основное видео проигрывалось при перелистывании слайдера, проигрывание видео останавливается, прогресс бар сдвигается к началу, иконки "Play" на панели управления и по центру видео меняются на первоначальные -2',
);
console.log('Кастомный видеоплеер, созданный на основе тега video +36');
console.log(
  'Управление плеером с клавиатуры. Горячие клавиши должны работать так же, как работают эти клавиши в YouTube видео +10',
);
console.log('Слайдер сравнения изображений в секции Explore +10');
console.log('Анимация при прокрутке изображений в секции Galery +8');
console.log('Калькулятор продажи билетов в секции Tiskets +10');
console.log('Калькулятор продажи билетов в форме продажи билетов +14');
console.log(
  'Валидация формы +16. Валидные номера телефонов: 12-45-67, 12-34-56-78, 123-45-67, 123-456, 123-567-789',
);
console.log('Интерактивная карта в секции Contacts +12');
console.log(
  'Любой собственный дополнительный функционал - кнопка прокрутки страницы вверх +10',
);
console.log('*****************');
console.log('Этап2: адаптивная верстка вёрстка');
console.log('Самооценка: 0 баллов');
console.log('*****************');
console.log('Этап1: фиксированная вёрстка');
console.log('Максимально возможное количество баллов: 160');
console.log('Не сделано:');
console.log('кнопке Book в форме покупки билетов добавлен ripple-эффект: -2');
console.log(
  'интерактивность при наведении иконок социальных сетей в футере предусматривает изменение цвета иконки и круглой границы вокруг иконки на золотистый -2',
);
console.log('Форма покупки билетов: -22');
console.log('Самооценка: 160-2-2-22=134');
