console.log('Этап3: добавление JavaScript');
console.log('Самооценка: /160 баллов');
console.log('Слайдер в секции Welcome +24');
console.log('*****************');
console.log('Этап2: адаптивная верстка вёрстка');
console.log('Самооценка: 0 баллов');
console.log('*****************');
console.log('Этап1: фиксированная вёрстка');
console.log('Максимально возможное количество баллов: 160');
console.log('Не сделано:');
console.log('кнопке Book в форме покупки билетов добавлен ripple-эффект: -2');
console.log(
  'интерактивность при наведении иконок социальных сетей в футере предусматривает изменение цвета иконки и круглой границы вокруг иконки на золотистый -2',
);
console.log('Форма покупки билетов: -22');
console.log('Самооценка: 160-2-2-22=134');
