console.log('Этап3: добавление JavaScript');
console.log('Самооценка: /160 баллов');
console.log('Слайдер в секции Welcome +24');
console.log(
  'Валидация формы +16. Валидные номера телефонов: 12-45-67, 12-34-56-78, 123-45-67, 123-456, 123-567-789',
);
console.log('Интерактивная карта в секции Contacts +12');
console.log('Дополнительный функционал - кнопка прокрутки страницы вверх +10');
console.log('*****************');
console.log('Этап2: адаптивная верстка вёрстка');
console.log('Самооценка: 0 баллов');
console.log('*****************');
console.log('Этап1: фиксированная вёрстка');
console.log('Максимально возможное количество баллов: 160');
console.log('Не сделано:');
console.log('кнопке Book в форме покупки билетов добавлен ripple-эффект: -2');
console.log(
  'интерактивность при наведении иконок социальных сетей в футере предусматривает изменение цвета иконки и круглой границы вокруг иконки на золотистый -2',
);
console.log('Форма покупки билетов: -22');
console.log('Самооценка: 160-2-2-22=134');
